{
  "title": "Establishing a Strong Support System at College",
  "description": "Advice on how form a social support system",
  "author": "Dr. Michael W. Kirst",
  "content": "Whether you are a student at college or university, higher education is one of the most challenging things that any individual can put themselves through. Without a doubt, being a student in college or university is a unique experience, allowing you to grow in ways you never thought were even possible. However, there will be moments of struggle and that is why having a reliable support system that genuinely cares about you and wants to help you succeed is more important than you could possibly imagine. This is especially true if you have moved away from home to attend college or university.\nFinding your clique on campus\nThe first notable difference any student will notice is that unlike high school, you will not see familiar faces throughout the day. If you happen to notice someone who is in all of your classes, you should reach out to them as potential study mates. However, if there are no such students, you might find that it is exceptionally hard to build connections because everyone else is in a different faculty.\nHowever, if you are outgoing and able to make friends easily, it is important to cultivate those relationships, so you have someone to depend on, rather than realising in your darkest moments that there is no one to reach out to.\nJoining a club or community or talking to a counsellor\nIf you are not as outgoing, an on-campus adviser might be able to point you in the direction of a suitable community club or activity you could thrive in.\nFrom the on-campus gym or a student-run club, it is possible to find a niche to call your own. As they say, birds of a feather flock together and when you have like-minded people, it would be easier to form bonds and a support system. It would also help you build your portfolio or resume, especially if it allows you to showcase your skills.\nSelf-support is more important than soldiering on\nAchieving academic excellence is important, it is true, but more than that it is important to take care of yourself first. You can retake classes. You can defer college or university for a semester, even a year if you want to. But your mental health and whole wellbeing is something that you should be prioritising before everything else – including academic success. Achieving perfect grade point averages means nothing if you do not have a firm handle on your mental state at the end of it all. Make a point to constantly prioritise you – even if it means dropping classes while you do so.",
  "article url": "https://collegepuzzle.stanford.edu/establishing-a-strong-support-system-at-college/"
}
